<a href="https://colab.research.google.com/github/ivangiangreco/tmp/blob/main/%5BData_Modeling_and_Database_Systems%5D_Intro_to_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

University of Lucerne

Data Modeling and Database Systems

# Intro to SQL

## 1. Preparation

We start by setting up a connection to our Students database, Students.db.

In [1]:
# download SQLite DB
!wget https://unilu-dmdb.github.io/data/Students.db

--2024-02-10 21:49:37--  https://unilu-dmdb.github.io/data/Students.db
Resolving unilu-dmdb.github.io (unilu-dmdb.github.io)... 185.199.108.153, 185.199.109.153, 185.199.110.153, ...
Connecting to unilu-dmdb.github.io (unilu-dmdb.github.io)|185.199.108.153|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 20480 (20K) [application/octet-stream]
Saving to: ‘Students.db’

Students.db         100%[===================>]  20.00K  --.-KB/s    in 0s

2024-02-10 21:49:37 (62.3 MB/s) - ‘Students.db’ saved [20480/20480]

In [2]:
# load the SQL magic extension
# https://github.com/catherinedevlin/ipython-sql
# this extension allows us to connect to DBs and issue SQL command
%load_ext sql

# now we can use the magic extension to connect to our SQLite DB
# use %sql to write an inline SQL command
# use %%sql to write SQL commands in a cell
%sql sqlite:///Students.db

For this exercise, we're utilizing SQLite 3. It's a compact and rapid relational database engine. SQLite databases are self-contained: each one resides in just a single file. Surprisingly, SQLite stands as the most utilized database engine globally. It's integrated into countless mobile devices (like Android or iOS phones) and serves as the backbone for storing data in numerous popular applications.

The following tables are present in the file you just downloaded:

In [3]:
%%sql
SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite_%';

 * sqlite:///Students.db
Done.

[('Students',), ('Diplomas',)]

## 2. Queries

### Basic Queries

In [4]:
%%sql
SELECT *
FROM Students

 * sqlite:///Students.db
Done.

[(1, 'Jessica', 'Bezos', 'USA', 1982),
 (2, 'Bill', 'Doors', 'USA', 1973),
 (3, 'Elona', 'Musk', 'Space', None),
 (4, 'Tim', 'Baker', 'USA', 1982),
 (5, 'Mark', 'Sugarhill', 'Metaverse', 2002),
 (6, 'Mark', 'Diverseen', None, 1993)]

In [5]:
%%sql
SELECT *
FROM Students
WHERE lname = 'Musk'

 * sqlite:///Students.db
Done.

[(3, 'Elona', 'Musk', 'Space', None)]

In [6]:
%%sql
SELECT *
FROM Students
WHERE matric_year = 1982

 * sqlite:///Students.db
Done.

[(1, 'Jessica', 'Bezos', 'USA', 1982), (4, 'Tim', 'Baker', 'USA', 1982)]

In [7]:
%%sql
SELECT lname as lastname
FROM Students
WHERE lives_in = 'USA'

 * sqlite:///Students.db
Done.

[('Bezos',), ('Doors',), ('Baker',)]

In [8]:
%%sql
SELECT lname
FROM Students
WHERE lives_in IS NULL

 * sqlite:///Students.db
Done.

[('Diverseen',)]

In [9]:
%%sql
SELECT DISTINCT fname
FROM Students
WHERE matric_year > 1990

 * sqlite:///Students.db
Done.

[('Mark',)]

In [10]:
%%sql
SELECT lname, lives_in
FROM Students
WHERE lives_in NOT IN ('USA')

 * sqlite:///Students.db
Done.

[('Musk', 'Space'), ('Sugarhill', 'Metaverse')]

In [11]:
%%sql
SELECT lname, matric_year
FROM Students
WHERE lives_in IN ('USA')
ORDER BY matric_year ASC

 * sqlite:///Students.db
Done.

[('Doors', 1973), ('Bezos', 1982), ('Baker', 1982)]

In [12]:
%%sql
SELECT COUNT(*) AS c
FROM Students

 * sqlite:///Students.db
Done.

[(6,)]

In [13]:
%%sql
SELECT MAX(matric_year)
FROM Students

 * sqlite:///Students.db
Done.

[(2002,)]

### Joins

In [14]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s, Diplomas AS d
WHERE s.studentid = d.studentid

 * sqlite:///Students.db
Done.

[('Jessica', 'Bezos', 'Bachelor of Science'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'MBA'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate')]

In [15]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s INNER JOIN Diplomas AS d ON (s.studentid = d.studentid)

 * sqlite:///Students.db
Done.

[('Jessica', 'Bezos', 'Bachelor of Science'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'MBA'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate')]

In [16]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s LEFT JOIN Diplomas AS d ON (s.studentid = d.studentid)

 * sqlite:///Students.db
Done.

[('Jessica', 'Bezos', 'Bachelor of Science'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Elona', 'Musk', None),
 ('Tim', 'Baker', 'MBA'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate'),
 ('Mark', 'Diverseen', None)]

In [17]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s RIGHT JOIN Diplomas AS d ON (s.studentid = d.studentid)

 * sqlite:///Students.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT s.fname, s.lname, d.diploma
FROM Students AS s RIGHT JOIN Diplomas AS d ON (s.studentid = d.studentid)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [18]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s FULL OUTER JOIN Diplomas AS d ON (s.studentid = d.studentid)

 * sqlite:///Students.db
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT s.fname, s.lname, d.diploma
FROM Students AS s FULL OUTER JOIN Diplomas AS d ON (s.studentid = d.studentid)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [19]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s CROSS JOIN Diplomas AS d

 * sqlite:///Students.db
Done.

[('Jessica', 'Bezos', 'Bachelor of Science'),
 ('Jessica', 'Bezos', 'Honorary Doctorate'),
 ('Jessica', 'Bezos', 'Honorary Doctorate'),
 ('Jessica', 'Bezos', 'MBA'),
 ('Jessica', 'Bezos', 'Honorary Doctorate'),
 ('Jessica', 'Bezos', 'Funny Award'),
 ('Bill', 'Doors', 'Bachelor of Science'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'MBA'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Funny Award'),
 ('Elona', 'Musk', 'Bachelor of Science'),
 ('Elona', 'Musk', 'Honorary Doctorate'),
 ('Elona', 'Musk', 'Honorary Doctorate'),
 ('Elona', 'Musk', 'MBA'),
 ('Elona', 'Musk', 'Honorary Doctorate'),
 ('Elona', 'Musk', 'Funny Award'),
 ('Tim', 'Baker', 'Bachelor of Science'),
 ('Tim', 'Baker', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'MBA'),
 ('Tim', 'Baker', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'Funny Award'),
 ('Mark', 'Sugarhill', 'Bachelor of Science'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate'),
 ('Mark', 'Sugarhill', 'MBA'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate'),
 ('Mark', 'Sugarhill', 'Funny Award'),
 ('Mark', 'Diverseen', 'Bachelor of Science'),
 ('Mark', 'Diverseen', 'Honorary Doctorate'),
 ('Mark', 'Diverseen', 'Honorary Doctorate'),
 ('Mark', 'Diverseen', 'MBA'),
 ('Mark', 'Diverseen', 'Honorary Doctorate'),
 ('Mark', 'Diverseen', 'Funny Award')]